hw0/hw0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CIS192 Spring 2013 Homework 0</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="CIS192 Spring 2013 Homework 0"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-22"/>
<meta name="author" content="Zachary Wasserman, Rafe Kettler, Ceasar Bautista"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CIS192 Spring 2013 Homework 0</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Due Date</h2>
<div class="outline-text-2" id="text-1">

<p>  This homework is due 2012-01-29 at 23:59:59. It should be submitted through
  our homework submission site (described below). Please start early and submit
  with time to spare if you are unfamiliar with Git.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Preparation</h2>
<div class="outline-text-2" id="text-2">

<p>  Please read and execute the Initial Setup section in the
  <a href="http://www.seas.upenn.edu/~cis192/submission/hwsubmission.html">homework submission instructions</a> on the course web page. Make sure you have a
  current version of Python 2 installed (&gt;2.7, we use 2.7.3).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Description</h2>
<div class="outline-text-2" id="text-3">

<p>  For this homework, you'll be exercising some of the Python basics we learned
  in the first two lectures. Implement the functions in the hw0.py file that
  you will retrieve from the upstream git repository. Make sure you take full
  advantage of Python's online documentation.
</p>
<p>
  To run tests, run <code>python hw0.py</code>, or call the <code>main</code> function. Notice that
  the test cases are derived from the docstrings of the functions. This is made
  possible by the Python standard library module <a href="http://docs.python.org/2/library/doctest.html">doctest</a>. We may test
  your code with additional test cases beyond those provided. You should add any
  additional cases you feel helpful in ascertaining correctness.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Grading</h2>
<div class="outline-text-2" id="text-4">

<p>  This assignment will be graded 60% on correctness, 40% on style. Try to be as
  "Pythonic" as possible. We will provide commentary on your code style via the
  Github submission system. You will have the opportunity to resubmit to improve
  your style grade, but your correctness grade will be capped at that you
  received on the initial submission.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Collaboration</h2>
<div class="outline-text-2" id="text-5">

<p>  While this course will have opportunities for collaboration, this is an
  <i>individual</i> assignment. All work you submit must be your own. If you use
  resources outside of the official Python online documentation, you must cite
  those resources by commenting your code. We take this seriously, and will use
  all reasonable methods to ensure the integrity of course assignments.
</p></div>
</div>
</div>

</body>
</html>
